# How to  create pandas DataFrame

In [1]:
import pandas as  pd

In [3]:
empty_df=pd.DataFrame()
print(empty_df)

Empty DataFrame
Columns: []
Index: []

In [4]:
list = ['a','b','c']
list

['a', 'b', 'c']

In [5]:
df=pd.DataFrame(list)
df

   0
0  a
1  b
2  c

In [6]:
ls_of_ls = [[1,2,3],[4,5,6],[7,8,9]]
ls_of_ls

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [7]:
df1 = pd.DataFrame(ls_of_ls)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
ls_dct = [{'a':1,'b':2},{'a':3,'b':5}]
df2=pd.DataFrame(ls_dct)
df2

   a  b
0  1  2
1  3  5

In [10]:
ls_dct1 = [{'a':1,'b':2},{'a':3,'b':5,'c':4}]
df3=pd.DataFrame(ls_dct1)
df3

   a  b    c
0  1  2  NaN
1  3  5  4.0

In [12]:
dct_sr={'ID': pd.Series([1,2,3]),'SN':pd.Series([111,222,350])}
df6 = pd.DataFrame(dct_sr)
df6

   ID   SN
0   1  111
1   2  222
2   3  350